#include <iostream>
#include <ctime>
#include <string>
#include <conio.h>

using namespace std;



int main() {
	setlocale(LC_ALL, "RU");

	// Открытие файла через его полное имя. Запрашиваю данные от пользователя.
	// Открываю файл на считывание.


	// Также сразу создаю файл на запись, в который буду помещать результат считывания.

	// Создаю переменную для индексации строк.
	// Обрабатываю первый файл построчно.
	// В каждой строке проверяю наличие скобочек ()
	// Если скобочки есть, то проверяю их на "правильность" и записываю во второй файл true или false
	// Если в строке нет скобок (пустая строка) , то записываю её как она есть во второй файл.
	// Вывод в виде: номер_строки - результат
	

	_getch();
	return 0;
}
